[
  {
    "Id": 1,
    "Name": "1865 single vineyard",
    "Description": "This wine demonstrates a strong bouquet, marked by elegant and intense aromas of ripe red fruit like cherries, plums and blueberries, in addition to cassis blended with notes of chocolate, mocha and cedar.Very dense and concentrated, with mature and noticeable tannins. In addition, the wine displays a very good balance between the tannins, acidity and oak.Ideal for accompanying red meats in general, venison, game birds, and strong cheeses.",
    "Price": 1494000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/35-1865-Single-Vineyard-Cabernet-Sauvignon-2011-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 2,
    "Name": "tondonia reserva 07",
    "Description": "A wine with medium-high depth of color — black-cherry red with garnet hues. First, red-fruit notes appear on the nose, with hints of fennel and scrubby heathland, all nicely balanced by smokey aromas from the time spent in medium-toasted wood. Underlying hints of vanilla come through with coffee notes. On the palate, there is a full mouth-feel with slightly mentholated nuances and white chocolate. The vanilla reappears and the red-berry fruit aromas found on the nose persist, with an elegant acidity which makes the aftertaste long.This wine can be paired with veal, Iberian pork charcuterie and some types of casseroles (stew).This wine is ruby-red with glints of brick-red and a medium-high depth of colour. Dense legs which provide you with a sequence of patterns around the sides of the glass.Initially you can find notes of red fruit aromas such as blackberries and reminders of spices. This is all well balanced by smoked aromas from its time in wood which had received a light-to-medium toasting. A subtle vanilla pod aroma coming through with roast coffee nuances.A smooth, mellow attack, with tannins wrapping the sides of the mouth with hints of menthol. In the finish the interesting lingering persistence is worthy of note.Food pairing:You can pair this wine with veal, Iberian ham and charcuterie and some kinds of stews and hotpots.",
    "Price": 2394000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/1-Catena-Alamos-Cabernet-Sauvignon-2013-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 3,
    "Name": "tignanello antinori",
    "Description": "Intensely ruby red in color with purple highlights, the 2013 Tignanello shows an intense nose of ripe red fruit in addition to notes of vanilla, chocolate, and leather imparted from the oak. Spicy and balsamic sensations give additional complexity in the layers of aromatics. The wine is ample and enveloping on the palate with supple tannins and a savory freshness that fully respects the character and personality of the Sangiovese grape. The balance between acidity and tannins is excellent and the finish and aftertaste are of a lovely length and persistence.James Suckling – “This is amazing on the nose with blackberry, black truffle, dried cherry and hints of tobacco. So complex on the nose. Almost no need to taste it. Full body, soft and velvety tannins, and a persistent, fabulous finish. The mouthfeel is magic. 80% Sangiovese and 20% Cabernet Sauvignon. Drink or hold.”",
    "Price": 4200000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Almaviva-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 4,
    "Name": "terrazas reserva malbec",
    "Description": "Bright red color with purple shades. Intense floral and fruity notes. Presence of violets, ripe black cherry and plum aromas. ReIts sweet and juicy mouthfeel delivers finesse, delicate tannins and an elegant finish of black fruits. veals a toasty and spicy character of black pepper and chocolate.Pair with Tuna Carpaccio and Red Fruits Vinaigrette, Tenderloin served with Mediterranean Ratatouille and Moist Semisweet Chocolate Cake over Mascarpone and Red Fruits Ice Cream.",
    "Price": 1590000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/69-AMARONE-DELLA-VALPOLICELLA-TOMMASI-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 5,
    "Name": "terrazas reserva cabernet",
    "Description": "Intense garnet red. Predominance of spicy notes of thyme and green pepper in harmony with an intense black fruit and figs background. A gentle and full wine. In the mouth, it reveals a precise and long finish.Pair with slow cooked lamb with spicy sauce and fresh salad or mashed potatoes.Wine Spectator – “A broad-textured red, with mocha notes to the roasted plum and dark cherry flavors. Dried mint and sage details show midpalate. The finish lingers with plenty of dark chocolate accents.”",
    "Price": 1134000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/63-BANFI-ASKA-BOLGHERI-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 6,
    "Name": "solaia",
    "Description": "An intense ruby red in color with purple highlights, the nose of the wine is dominated by varietal notes of excellent freshness and an elegant intensity. The 2012 Solaia has a classic style and is characterized on the palate by the pleasurable harmony of flavors created by a fine balance between acidity and tannins and high level fruit which lasts from the initial impact through to the lengthy finish and aftertaste. A grand personality and a great persistence make the finish exceptionally complex and vibrant.Pairs well with grilled chicken, veal medallions, lamb in a red wine sauce, roasted pork loin, grilled tuna with a pepper crust.",
    "Price": 11400000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/73-MARCHESI-ANTINORI-“SOLAIA”-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 7,
    "Name": "penfolds bin 8",
    "Description": "Bin 8 has been crafted in the traditional Penfolds style. Ripe, balanced fruit fl avours are supported by softly integrated oak resulting in an impressive, smooth red wine. It was introduced in response to a heightened interest in Cabernet Shiraz blends – a classic Australian wine style that caught the attention of the international wine media. Mulberry and plum fruits immediately ascend. Violet and iris fl orals sit atop vanilla and fermented tea-leaf aromatics. Scents of smoky/sweet roast-beef scrapings disguise shy oak.Suggested food pairing: Caramelised lamb, pickled tongue and smoked green chilli.",
    "Price": 1800000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/51-PENFOLDS-BIN-8-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 8,
    "Name": "penfolds bin 407",
    "Description": "Inspired by Bin 707, Bin 407 offers varietal definition and approachability, yet still with structure and depth of flavour. Textbook Cabernet Sauvignon, the varietally expressive Bin 407 highlights the rewards of Penfolds multi-region, multi-vineyard blending, with a core of ripe fruit supported by sensitive use of French and American oak.One of Australia’s oldest wineries, Penfolds was founded in Adelaide in 1844 by Christopher Rawson Penfold. Renowned for its iconic range of red wines including the world-famous ‘Grange’ though their range extends to many much more affordable wines too!",
    "Price": 3900000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Penfolds-Bin-407-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 9,
    "Name": "parallele 45, jaboulet",
    "Description": "This Domaine Paul Jaboulet Côtes du Rhône takes its name from the 45th North parallel which runs two kilometres from the cellars of Maison Paul Jaboulet. Their wine has had this name since the beginning of the 1950s. Elegant and aromatic Grenache blend, with red fruits blended with spices. Well-structured on rounded tannins, with a final spicy note.",
    "Price": 834000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/23-Catena-Alta-Malbec-2012-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 10,
    "Name": "overture by opus one",
    "Description": "The 2013 Opus One offers splendid aromas of blueberry, cassis, and blackberries with highlights of rose, anise and baking spices. A creamy entry gives way to layers of complexity which unfold in the mid-palate with velvety tannins enrobing a center of concentrated black-fruit with juicy freshness. Elegantly balanced, the acidity and core structure deliver a persistent finish with hints of dark chocolate. The 2013 Opus One promises enjoyment for decades to come.",
    "Price": 7740000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Catena-Cabernet-Sauvignon-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 11,
    "Name": "torbreck old vine",
    "Description": "The 2013 Steading has a vibrant, purity of fruit, mid palate concentration and tannin profile making it an exemplary wine. Barossa cultivars of old vine Grenache, Shiraz & Mataro. Vibrant aromas of dark cherry, blackberry, and star anise all unfold to reveal an impressive array of underlying fruit flavours.Dense, succulent dark fruits with layers of liquorice, plum, black olive, earth, white pepper and Asian spice. These complex yet elegant flavours are all neatly interwoven with a perfect balance of acidity and supple, silky tannins.",
    "Price": 960000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/5-CATENA-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 12,
    "Name": "ornellaia",
    "Description": "“What appeared to be a disadvantage for the 2013 vintage – late budding and flowering – proved to be a major advantage thanks to a warm summer and month of September offering textbook conditions for harvesting, with cool temperatures but a prevalence of sunny weather. This resulted in slow but complete ripening with great balance and a delightful aromatic quality, which we like to define as “Elegance”. Ornellaia 2013, with its dense, vibrant colour, has a nose of splendid aromatic complexity built around a limpid and brilliant fruitiness, underscored by refined spicy and balsamic notes. The mouth develops vibrant and complex fruity nuances framed by a dense, slender structure with tannins that attain a rare harmony between firmness and fleshiness, concluding with a long balanced and fresh finish.”",
    "Price": 5700000,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/67-Ornellaia-Le-Serre-Nuove-dellOrnellaia-2013-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 13,
    "Name": "napanook dominus",
    "Description": "Dominus, with its remarkably complex nose, is an utterly seductive wine. It displays red and black fruits and an ethereal aroma of deep cherry, warm citrus and marzipan. Finely polished tannins on a beautiful, weightless finish are accompanied by great depth and length.",
    "Price": 3900000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Chateau-dArmailhac-Rothschild-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 14,
    "Name": "muga",
    "Description": "A wine with medium-high depth of color — black-cherry red with garnet hues. First, red-fruit notes appear on the nose, with hints of fennel and scrubby heathland, all nicely balanced by smokey aromas from the time spent in medium-toasted wood. Underlying hints of vanilla come through with coffee notes. On the palate, there is a full mouth-feel with slightly mentholated nuances and white chocolate. The vanilla reappears and the red-berry fruit aromas found on the nose persist, with an elegant acidity which makes the aftertaste long.This wine can be paired with veal, Iberian pork charcuterie and some types of casseroles (stew).This wine is ruby-red with glints of brick-red and a medium-high depth of colour. Dense legs which provide you with a sequence of patterns around the sides of the glass.Initially you can find notes of red fruit aromas such as blackberries and reminders of spices. This is all well balanced by smoked aromas from its time in wood which had received a light-to-medium toasting. A subtle vanilla pod aroma coming through with roast coffee nuances.A smooth, mellow attack, with tannins wrapping the sides of the mouth with hints of menthol. In the finish the interesting lingering persistence is worthy of note.Food pairing:You can pair this wine with veal, Iberian ham and charcuterie and some kinds of stews and hotpots.",
    "Price": 1074000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Muga-reserva-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 15,
    "Name": "moulins de citran",
    "Description": "Cornas has a dark full color with a purple edge. The aroma is intense with black fruit, pepper, violets and roasted chocolate. Cornas tastes powerful and dark with spicy fruit that clearly refers to the granite surface. The wine has ripe and round tannins and a stunning mineral final.Serve at room temperature, when young with grilled meat, delicious after 5 years with game and aged cheeses.This small appellation is located on the right bank of the Rhone Valley with granite soils at an altitude of 300m. A cold maceration removes all the aromas and the deep color from the fruit. In all, maceration and fermentation takes 20 days with pumping and pigeage to the end. The wine ages in 1 and 2 year old barrels for 15 months.",
    "Price": 1554000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/81-Paul-Jaboulet-Aine-Châteauneuf-du-Pape-Les-Cèdres-Rouge-2006-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 16,
    "Name": "montes purple angel",
    "Description": "The grapes for Purple Angel come from Montes’ own vineyards in Apalta and Marchigüe, arguably two of the finest sites in the Colchagua Valley. In Apalta, vines are planted on 45° slopes, providing good exposure to achieve ripeness. Cool ocean breezes and low nighttime temperatures moderate this warm area, permitting slow development and retention of varietal aromas and acidity. Marchigüe is slightly cooler because of its closer proximity to the ocean. Conditions are dry, reducing the threat of fungal disease and resulting in consistently healthy harvests. All grapes were hand harvested.Purple Angel displays the rich flavours typical of Carménère. The addition of Petit Verdot gives spice, colour, structure and acidity. Deep ruby red in colour, the wine has alluring red and blackberry notes on the nose. The palate is densely concentrated, with spice and mocha lingering on the finish.",
    "Price": 3300000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Montes-Purple-Angel-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 17,
    "Name": "montes alpha m",
    "Description": "Intense dark red colour. Very elegant with very dense and velvety, supple tannins. The wine has an harmonious structure, combined with a generous fruit expression and a very distinguished character showing aromas of red fruits, cassis and a touch of cedar and cinnamon. In the mouth the wine has delightful notes of vanilla and coffee. The 5% of Petit Verdot adds an extra element of complexity. Mouth filling and long and well-defined through the finish. The structure of this wine will keep it for over 20 years.Highly recommended with baked turkey, rib eye steak, sherry kidneys, duck confit.",
    "Price": 3600000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/39-Montes-Alpha-M-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 18,
    "Name": "montes alpha",
    "Description": "A lively red color is the first clue that the wine before us is very fresh. Its aromatic potency is very well harmonized with its complexity. There’s a predominance of red berries, jam, blackcurrant liqueur (creme de cassis}, and a juicy sensation of crushed strawberries. Eight months in contact with French oak lend it a certain degree of seriousness, along with a bit of vanilla, smoke, cigar box, and sweet spices. Good balance on the palate with properly rounded tannins that enable this Cabernet Sauvignon to linger long on the palate.Highly recommended with braised beef with French fries, steak and eggs, paella, cannelloni, and lasagna.Wine Spectator – “There’s minerally freshness to the ripe dark plum, blackberry and cherry flavors, with peppery hints. Well-structured and crisp midpalate, featuring Asian spice and black fig notes on the finish. Drink now through 2020.”",
    "Price": 1074000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/34-MONTES-ALPHA-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 19,
    "Name": "migration",
    "Description": "As with any great wine, Alto will show at its best when served with the finest foods that are simply prepared. A filet mignon or Chateaubriand grilled medium-rare are perfect, as are lechazo, roast suckling baby lamb or grilled chuletas de cordero, lamb chops.",
    "Price": 1980000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Clos-du-Val-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 20,
    "Name": "merryvale",
    "Description": "Drawn from three top Napa vineyards; Kenefick Ranch, Salvador and Rancho Chimiles, our Cabernet Sauvignon is handpicked and undergoes a triple sorting upon arrival at the winery. The grapes then undergo an extended maceration and a long, cool fermentation for increased flavor, color and aroma. Aged in 50% new French oak barrels, the wine matures for 22 months before being deemed ready for release. Our Napa Cabernet bottling is always blended with other Bordeaux varietals for their added aromatic and balanced tannin contributions.A quintessential Napa Cabernet, this wine is rich and dark in the glass. Aromas of blackberry and faint dried herb waft up from the rim towards you. Upon tasting, the wine has a broad and pleasant entry, moving to a focused and weighty mid palate with notes of cassis, toast and graphite. A lengthy finish shows well proportioned tannin that will gain even more complexity as time passes. With proper cellaring, this wine will drink beautifully for the next 15 years.",
    "Price": 3474000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Merryvale-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 21,
    "Name": "massetto",
    "Description": "Tenuta dell’Ornellaia Masseto Merlot is a dry red wine produced in Toscana, Italy. The wine boasts a vibrant, perfectly balanced and rounded taste, featuring notes of fruit, minerals, espresso, chocolate with spices and licorice. The finish is long and satisfying. The aroma is elegant and complex, with an air of sophistication. This exquisite wine makes an excellent accompaniment for meat and pasta dishes.",
    "Price": 18000000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/43-VN-DECOY-cabernet-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 22,
    "Name": "opus one",
    "Description": "The 2013 Opus One offers splendid aromas of blueberry, cassis, and blackberries with highlights of rose, anise and baking spices. A creamy entry gives way to layers of complexity which unfold in the mid-palate with velvety tannins enrobing a center of concentrated black-fruit with juicy freshness. Elegantly balanced, the acidity and core structure deliver a persistent finish with hints of dark chocolate. The 2013 Opus One promises enjoyment for decades to come.",
    "Price": 16800000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/46-Opus-One-2013-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 23,
    "Name": "marchesi di barolo, coste di rose",
    "Description": "Barbera is typically marked by red cherry, raspberry, and blackberry flavors backed by a signature zingy acidity and smooth tannins. More complex examples can include notes of cocoa, savory spice, anise, and nutmeg. In warmer New World climates, Barbera is all about the fruit, sometimes leaning towards over-ripe or dried fruit flavors that can give an impression of sweetness to the wine. Old World Barbera can develop intriguing notes of graphite, smoke, lavender, and violet.Barbera’s prominent acidity makes it a natural match with tomato-based dishes, therefore making it an easy pairing with a wide array of Italian cuisine. It works just as well with lighter red meat dishes, hamburgers, or barbecue.",
    "Price": 3000000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Don-Melchor-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 24,
    "Name": "torbreck woodcutters",
    "Description": "This wine reflects the up & coming Shiraz vineyards of the Barossa, rather than the battle hardened old vines which make up the core of our other cuvee’s. Full of deep, dark berry fruit, the 2015 vintage is sensational array of opulent rich fruit with a wonderful freshness and balance. A dark deep, central core of fruit gives way to an intense textural mid palate full of mocha, plum, spice and dark chocolate. Whilst offering immense pleasure in its youth the 2015 Woodcutter’s Shiraz will certainly develop into an impressive wine with a few years in the cellar. Another fantastic introduction to the Torbreck range.",
    "Price": 1390000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Gaja-Ca-Marcanda-Vistamare-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 25,
    "Name": "trivento golden reserve",
    "Description": "Founded in 1996, Trivento produces brand-name wines under their own label. The company has created a portfolio of wines distinguished for preserving the character of the Mendozan terroir. These wines have received numerous recognitions at international contests and in wine industry publications. Trivento has become the most diversely distributed Argentine wine brand in the world positioning the positioning the company among the preeminent Argentine exporters.Yellow with olive tinges in colour with aromas of white peach and green apple. Fresh acidity with a fruity finish.Wine of Mendoza, Argentina; 2016 Gold Decanter Award winner",
    "Price": 1494000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Gevrey-Chambertin-Latour-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 26,
    "Name": "krug grande cuvee",
    "Description": "Behind every precious drop of Krug stands the dream of a visionary. One man who, long before others, understood that the essence of Champagne is pleasure. So, over 170 years ago, Joseph Krug broke with convention to follow his vision. To create the most generous expression of Champagne every year, regardless of climatic unpredictability.Joseph’s bold experiment proved a triumph and he succeeded in creating Champagne like never before. And like no other Champagne House since. To this day, the House of Krug lives and breathes his enduring philosophy, creating only prestige Champagnes since 1843. Deep golden colour and fine, vivacious bubbles, predicting fullness and elegance. Aromas of flowers in bloom, ripe & dried fruit, marzipan, gingerbread and citrus fruits. Flavours of hazelnut, nougat, barley sugar, jellied and citrus fruits, almonds, brioche and honey.Krug Grande Cuvée lends itself to a plethora of culinary combinations, from the simplest to the most sophisticated, from an extra mature parmesan to a dish of turbot à la truffle.",
    "Price": 12500000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Guidalberto-by-Sassicaia-100x100.jpg",
    "SubCategory": 16,
    "Category": 5
  },
  {
    "Id": 27,
    "Name": "dom perignon",
    "Description": "Dom Pérignon (1638–1715) was a monk and cellar master at the Benedictine abbey in Hautvillers. He pioneered a number of winemaking techniques around 1670—being the first to blend grapes in such a way as to improve the quality of wines, balance one element with another in order to make a better whole, and deal with a number of their imperfections; perfecting the art of producing clear white wines from black grapes by clever manipulation of the presses.Dom Perignon has an intense, full and radiant bouquet with notes of honeysuckle, orange coloured fruits and hints of iodine sensations. The creamy chewiness characterizing the vintage is channelled in a direction that is edgy yet embracing with a wave of aromatic persistence. Smoky, biting and full energy finish balances it all out.The Dom Perignon pairs very well with sushi, scallops, oysters, white fish, white meat.",
    "Price": 12000000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Kaiken-Reserva-malbec-100x100.jpg",
    "SubCategory": 16,
    "Category": 5
  },
  {
    "Id": 28,
    "Name": "bollinger special cuvee brut",
    "Description": "To the eye: A golden colour, distinctive of black grape varieties; very ne bubbles. To the nose: A beautiful aromatic complexity; ripe fruit and spicy aromas; hints of roasted apples, apple compote and peaches. On the palate: A subtle combination of structure, length and vivacity; bubbles like velvet; pear, brioche and spicy aromas, notes of fresh walnut.This wine goes very well with any fish, especially sushi and sashimi. Seafood: shrimp, prawn, crayfish, grilled lobster. Poultry and white meat. Parmesan, good cured ham.",
    "Price": 2580000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Kaiken-Ultra-malbec-100x100.jpg",
    "SubCategory": 16,
    "Category": 5
  },
  {
    "Id": 29,
    "Name": "bollinger rose",
    "Description": "To the eye: bronze tones combined with the intense depth of a great red wine. To the nose: the nobility of red berries: hints of red currant, cherry and wild strawberry;a spicy touch, not unlike Special Cuvée. To the palate: a subtle combination of structure, length and vivacity, with a tannic finish due to the adjunction of red wine; bubbles as fine as velvet; flavours of wild berries.Cellar aged for more than twice the time required by the appellation.it pairs well with crayfish, lobster, one-side cooked salmon. Japanese cuisine or not-so-spicy Asian cuisine.",
    "Price": 3120000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Lapostolle-Cabernet-Sauvignon-1-100x100.jpg",
    "SubCategory": 16,
    "Category": 5
  },
  {
    "Id": 30,
    "Name": "prosecco liquid gold classic",
    "Description": "Selected and healthy grapes; soft pressing and 10-day test winemaking in steel tanks. After the second fermentation at controlled temperature in pressurised vats using the Charmat method, the wine is filtered and decanted with isobaric technique before being bottled.Pale straw yellow with light lime green highlights. Pleasant, light, fine, delicate and long-lasting, fruity, with characteristic bouquet of Golden Delicious apples. Velvety, fresh, fruity and lively, slight and smooth, with a fine perlage, full-bodied, harmonic, excellent acidity.A classic Venetian aperitif, ideal with all meatbased starters, sausages, seafood salad and fish and shellfi sh pasta and rice courses. Perfect with white meats, grilled, boiled or fried fish with polenta.",
    "Price": 890000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/28-Lapostolle-Merlot-2014-100x100.jpg",
    "SubCategory": 17,
    "Category": 5
  },
  {
    "Id": 31,
    "Name": "whispering angel, chateau desclans",
    "Description": "Strikingly pale pink in color, the aromas are fresh and fruity. On the palate, it is bone dry through the finish. The name really suits the delicate nature of this wine.",
    "Price": 1254000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/35-Lapostolle-Cuvee-Alexandre-Merlot-100x100.jpg",
    "SubCategory": 18,
    "Category": 5
  },
  {
    "Id": 32,
    "Name": "cotes de provence, villa garrel",
    "Description": "In the 16th century, the Villa Garrel was part of the former fief of Piegros. Today, Château de l’Aumérade Cru Classé is the jewel of the Fabre properties. Completely renovated, it now houses the head office of Fabre en Provence. The initials HF, engraved in one of the stones of the bastide, date from the Emperor Napoleon III (1868).Today, the vintners have the most modern equipment available with which to work, and craft an array of outstanding wines — including one for which Provence is perhaps best known: a fresh and juicy rosé.Crafted from three grape varieties — Grenache, Cinsault and Syrah — the 2018 Villa Garrel Rosé is a delightful wine with strawberry and papaya flavors that cascade into a long and creamy finish. It’s a wonderful wine for sipping on a hot summer day, or makes a great companion to summer salads.Pale pink, fruit-forward and refreshing rosé, crafted from Grenache, Cinsault and Syrah grapes. The nose is dominated by intense aromas of orange peel, white peach, strawberry and red cherry. This light and crisp rosé can complement a meal perfectly or be delightful on its own. Pairs well with light appetizers or spicy tapas.",
    "Price": 890000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/67-Ornellaia-Le-Serre-Nuove-dellOrnellaia-2013-100x100.jpg",
    "SubCategory": 18,
    "Category": 5
  },
  {
    "Id": 33,
    "Name": "villa maria private bin",
    "Description": "Fruit for this wine was sourced from vineyards across the Marlborough region in the Wairau and Awatere valleys spanning a range of different meso-climates. Careful attention was paid to vine health and cropping levels to give the vine the best chance to optimise the season and develop strong, clean flavours.This intense Sauvignon Blanc is alive with a myriad of flavours dominated by gooseberry, passionfruit, fresh citrus, melon and herbaceous aromas. The wine has an enticing palate with a juicy flavour profile, purity and concentration, finishing crisp and clean with an interwoven thread of acidity.This Sauvignon Blanc is the perfect pairing with seafood and all white meats.",
    "Price": 990000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/64-LUCENTE-LUCCE-DELLA-VITE-100x100.jpg",
    "SubCategory": 19,
    "Category": 5
  },
  {
    "Id": 34,
    "Name": "trivento reserve",
    "Description": "Founded in 1996, Trivento produces brand-name wines under their own label. The company has created a portfolio of wines distinguished for preserving the character of the Mendozan terroir. These wines have received numerous recognitions at international contests and in wine industry publications. Trivento has become the most diversely distributed Argentine wine brand in the world positioning the positioning the company among the preeminent Argentine exporters.Yellow with olive tinges in colour with aromas of white peach and green apple. Fresh acidity with a fruity finish.Wine of Mendoza, Argentina; 2016 Gold Decanter Award winner",
    "Price": 534000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Masseto-100x100.jpg",
    "SubCategory": 19,
    "Category": 5
  },
  {
    "Id": 35,
    "Name": "trapiche oak cask",
    "Description": "Founded in 1883, Trapiche is one of Argentina’s best-known wine brands. Located at the foothills of the Andes in Mendoza, they own more than 3000 acres of vineyards ranging from 600 meters to over 1200 meters. Chief winemaker, Daniel Pi’s goal and vission is to represent the richness and diversity of Argentina’s terroir. Trapiche is dedicated to creating the best Malbec wines in the world as exemplified by the winery’s most successful project, The Single Vineyard Malbec Series. As a tribute to the growers’ passion and dedication, the winery selects three of its best growers and bottles their wines exclusively in limited production. The result is rich, incredibly massive, terroir-driven wines, prossessing bold, powerful fruit that express passion, history and the grower’s personal touch.Purple-colored, the nose offers up plum and black cherry notes with a touch of black pepper. The palate is soft and round with ripe, saturated berry flavors. Finishes spicy and full with chewy tannins.Ideal to serve with cheeses, red meats, mushrooms, stew and the typical Argentinian “asado”.",
    "Price": 540000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/11-TRAPICHE-OAK-CASK-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 36,
    "Name": "trivento golden reserve",
    "Description": "Founded in 1996, Trivento produces brand-name wines under their own label. The company has created a portfolio of wines distinguished for preserving the character of the Mendozan terroir. These wines have received numerous recognitions at international contests and in wine industry publications. Trivento has become the most diversely distributed Argentine wine brand in the world positioning the positioning the company among the preeminent Argentine exporters.Yellow with olive tinges in colour with aromas of white peach and green apple. Fresh acidity with a fruity finish.Wine of Mendoza, Argentina; 2016 Gold Decanter Award winner",
    "Price": 1494000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/34-MONTES-ALPHA-100x100.jpg",
    "SubCategory": 19,
    "Category": 5
  },
  {
    "Id": 37,
    "Name": "meursault 1er cru perrieres, latour",
    "Description": "Situated just south of Volnay and Pommard in the Côte de Beaune, Meursault is the most extensive southerly white wine commune of the Côte-d’Or. Surprisingly enough for an appellation of this quality, no Grand Cru exists, however the high quality of the 1er Cru more then compensates for this. The vineyard of Meursault « Perrières » tends to show a soil that is thinner and stonier than many of its immediate neighbours, producing what is arguably one of the finest example of the wine from this village.This 1er Cru offers a complex and floral nose with grilled almond hints. The mouth is round with acacia honey and yellow peach notes. The oaky is ample lingering into a beautiful persistence.Chicken in cream sauce – skate in brown butter – white truffle risotto – Epoisses cheese",
    "Price": 3000000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/39-Montes-Alpha-M-100x100.jpg",
    "SubCategory": 19,
    "Category": 5
  },
  {
    "Id": 38,
    "Name": "gaja camarcanda, vistamare",
    "Description": "Intense floral notes of acacia and linden flowers. The refreshing presence of Fiano gives notes of fern, musk and menthol. On the palate, it is fresh and compact with notes of bergamot, pear, nectarine and white currant. Then it shifts toward a more mineral and spicy character, with notes of flint, rosemary, saffron. The wine gets riper in the finish with hints of mango, almond and fig leaves.On the palate, the wine is intensely smooth and characterized by an electric tang of acidity and minerality. The wine finishes with ripe and honey notes.",
    "Price": 2100000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Montes-Purple-Angel-100x100.jpg",
    "SubCategory": 19,
    "Category": 5
  },
  {
    "Id": 39,
    "Name": "cloudy bay",
    "Description": "Bright, focused citrus aromatics of grapefruit and kaffir lime abound, supported by subtle tropical notes. A silky, concentrated palate reveals ripe, juicy stone fruit and lemongrass, supported by a subtle minerality. Its racy acidity leads toward a mouth-watering, persistent finish, suggesting a sauvignon blanc with ageability.This wine will complement fish, poultry, white meats and cured meats.",
    "Price": 1494000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Cornas-Maison-Les-Alexandrins-100x100.jpg",
    "SubCategory": 19,
    "Category": 5
  },
  {
    "Id": 40,
    "Name": "chablis, domaine chanson",
    "Description": "Aromas of grape fruit mixed with floral fragrances on a delicate minerality. Pure, pinear and well-defined, good structure, beaufitul aromatic combination, refreshing mineral finish, straight and of good length.Fish pâté, veal with cream sauce, lobsters and poultry as well as some goat cheeses.",
    "Price": 1254000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Muga-reserva-100x100.jpg",
    "SubCategory": 19,
    "Category": 5
  },
  {
    "Id": 41,
    "Name": "banfi le rime",
    "Description": "Pinot Grigio and Chardonnay are nurtured to perfection in select hillside vineyards of the Banfi estate in Montalcino, Tuscany. The grapes are gently pressed, followed by vinification “in bianco,” or “off the skins” at low temperatures in stainless steel resulting in a delightfully harmonious wine. Le Rime, pale straw in color, is an aromatic, fruity white wine with a crisp finish replete with refreshing acidity. Served chilled, Le Rime is the perfect partner to a full range of foods including pasta, vegetables, fish, seafood, veal and poultry dishes.Pale straw yellow. Bouquet: Hints of pear and white flowers. Taste: Well balanced with an unusually lively acidity.A splendid aperitif and a delightful complement to antipasto, pasta, and light meals.",
    "Price": 654000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Dominus-estate-cabernet-sauvignon-napa-valley-100x100.jpg",
    "SubCategory": 19,
    "Category": 5
  },
  {
    "Id": 42,
    "Name": "vistalba corte c",
    "Description": "Intense red color. Red fruit aromas, prunes and rippen cherries. Sweet entrance, silky tannis. Ripened cherries and dry fruits such as alomd and nuts.Pairs well with meat, pasta, stews, leumes, mature cheese.",
    "Price": 990000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Bodega-Vistalba-Corte-C-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 43,
    "Name": "vistalba corte b",
    "Description": "Intense bordeaux color with brillant violet hues. Fresh prunes aromas, dry fig and blackberries. Barrel aromas such as tabacco, vanilla and cedarwood. Sweet and velvety tannis. Great volume and body. Cacao, dark chocolate and subtle coffee notes can be found on its long lasting finish.Pairs well with grilled red meats, roast game birds, mature cheese.",
    "Price": 1254000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/16-BKK-Bodega-Vistalba-Corte-B-2015-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 44,
    "Name": "vistalba corte a",
    "Description": "Made with grapes from the Vistalba land, these wines are a complete universe for the palate. Blends from the best selection of Malbec, Cabernet Sauvignon and Bonarda red grapes representing the best of each harvest and with great qualities for storage.Color: Intense garnet red.Nose: Complex aromas where dark chocolate, prune and tobbaco stand out.Palate: Sweet entrance, good volume and structure. Long lasting end where notes of chocolate and spices appears on the back.Winemaking: this wine is 100% aged in new French Oak for 18 months, then stored for 12 months in the bottle prior to being released into the market. All grapes are hand harvested from old vines, most planted around 1948. Vineyards sit 950m above sea level and good climatic conditions allow the winery to maintain vineyards almost naturally with almost no fitosanitary treatment. During the vegetative season there is a difference of temperature between day and night of 15¡C allowing for excellent colour and tannin development.",
    "Price": 2520000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Bodega-Vistalba-Corte-A-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 45,
    "Name": "vega sicillia, valbuena 5",
    "Description": "Vega Sicilia is the most significant wine producer in Spain, considered amongst the greatest in the world. Their property is found 700 metres above sea level in the shallow Spanish part of the Duero River valley on the high remote plateau of Castilla y Leon. This unique climate delivers cold nights and hot days, allowing the grapes to become beautifully ripe and develop wonderful tannic structure, with a delightful backbone of acidity and therefore superb balance.The Valbuena 5° takes its name from the village where it is produced. It is aged for less time than the Unico or the Reserva Especial with the 5° designating the years it has been aged before release.",
    "Price": 5400000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Penfolds-Bin-407-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 46,
    "Name": "schloss vollrads",
    "Description": "This is a beautifully aromatic wine. The nose and palate are filled with peaches, lemon, and lime rind, along with stony minerality and a nice touch of petrol. Just a bit off-dry, but with juicy acidity the Schloss Vollrads is ripe and full. There is a hint of bitterness in the long finish. A perfect wine for a warm summer evening!",
    "Price": 894000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/51-PENFOLDS-BIN-8-100x100.jpg",
    "SubCategory": 19,
    "Category": 5
  },
  {
    "Id": 47,
    "Name": "taittinger brut reserve",
    "Description": "Brut Réserve Taittinger is one of the last great Champagne Houses to remain independent and is owned and actively managed by the family named on the label. The family are guardians of Taittinger’s style quality and integrity. The hallmark of their fine Champagnes is the high proportion of Chardonnay used in their winemaking which is key, in the Champagne region, for producing wines of great elegance and finesse. Additionally, with its vineyard ownership of 288 ha (one of the largest in Champagne}, Taittinger can guarantee a flawless signature, and wines heralded worldwide for their consistent quality. Our signature cuvée, Taittinger Brut Réserve, is assembled from more than 35 crus and incorporates 40% Chardonnay – this high level is seldom offered in a non-vintage Champagne. Distinguished by a delicate nose marked by subtle brioche notes, it has a palate of considerable depth and balance with hints of honey and fresh fruit with a long, fresh finish.",
    "Price": 2100000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/73-MARCHESI-ANTINORI-“SOLAIA”-100x100.jpg",
    "SubCategory": 16,
    "Category": 5
  },
  {
    "Id": 48,
    "Name": "lucente, luce della vite",
    "Description": "Lucente 2014 is a deep red color with purple highlights. The wine’sbouquet is complex: fruity notes of black cherry and small red fruitsare enhanced by moderately toasted scents; pleasant vanilla and lightly roasted coffee beans linger delicately in the background. Well rounded with silky tannins that bestow a balanced and harmonious structure, this is an eminently elegant and enjoyable wine.James Suckling – “Lots of blueberry, black currant and lavender aromas and flavors to this. Medium to full body, fine tannins and a fresh finish. Drink or hold. So long and refined. Extremely well done.”",
    "Price": 1434000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/17-TERRAZAS-RESERVA--100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 49,
    "Name": "le petit clos apalta",
    "Description": "Cool aromas of cola, coffee, blackberry, stewed plum, herbs and minerals make for a highly attractive and complex bouquet. In the mouth, wall-to-wall power and tannins suggest that this needs a few more years to mellow out. Flavors of stewed plum, blackberry, Carolina barbecue sauce and a hint of citrus peel are complex and set up a deep finish with dark flavors and intensity to spare.",
    "Price": 2700000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/15-TERRAZAS-reserve-malbec-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 50,
    "Name": "chateau la fleur-petrus",
    "Description": "Situated between Châteaux Lafleur and Petrus, Château La Fleur-Pétrus took its name in the 18th century. Jean-Pierre Moueix, who established his wine merchant business in Libourne in 1937, purchased La Fleur-Pétrus in 1950. This historic estate on the plateau of Pomerol was his first vineyard acquisition.La Fleur-Pétrus is composed predominantly of Merlot, which lends silkiness and generosity to the wine, while a small percentage of Cabernet Franc contributes rigor and complexity.The vineyard is made up of three parcels on the plateau of Pomerol with altitudes averaging 33 to 38 meters above sea level. The pebbly soils from the northern parcel yield a wine of great elegance with notes of black cherries. The center plot, known for its summer heat (the area is called “Tropchaud”}, produces a wine of tremendous suppleness with a hint of plum. Wine from the southern parcel is particularly velvety, dense, structured, with a pronounced nose of blackcurrant.Blended, these three singular terroirs with nuanced and complementary characteristics produce a generous, expressive wine with apparent structure and a dominance of black fruit. An attentive tasting reveals remarkable refinement, complexity, and a touch of violet.",
    "Price": 12000000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/70-MARCHESI-ANTINORI-“TIGNANELLO”--100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 51,
    "Name": "chateau darmailhac, pauillac",
    "Description": "The wine is a garnet red with a crimson tint. The highly expressive nose is remarkable for its intense and radiant red fruit aromas mingled with notes of roasted coffee and marzipan. The ample and full-bodied attack reveals a well-rounded, silky tannic structure, giving an impression of richness and volume, underlined by a generous and varied range of flavours such as cherry, vanilla and liquorice. The long finish is sustained by hints of chocolate.",
    "Price": 3300000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/6-Torbreck-Woodcutter-Shiraz-2015-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 52,
    "Name": "chateau tertre, grand cru classe",
    "Description": "The complex aroma is punctuated by long-lasting touches of fully-ripe red berries. Drunk as a young wine, Château Pindefleurs allows its fresh fruitiness to blossom. Kept in a cellar, it unrolls a long and silky taste in the mouth, the mark of the Grands Crus of Saint-Emilion.Since Bordeaux red blends are often quite structured and tannic, they pair best with hearty, flavorful, and fatty meat dishes. Any type of steak makes for a classic pairing. Equally welcome with these wines would be beef brisket, pot roast, braised lamb, or smoked duck.",
    "Price": 2520000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/11-TRAPICHE-OAK-CASK-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 53,
    "Name": "caymus grand durif",
    "Description": "A dark, ruby red, with the lush scent of German chocolate cake and wisps of cigar tabacco. The palate of this wine is refined, bold, and layered, with cassis at the center, infused with warming notes of chocolate and ripe dark berries. Grippy tannis maintain structure yet are velvety soft, allowing flavors of continually evolve during a lingering finish that showcases this wine’s multiple layers of complexity.",
    "Price": 3060000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Vega-Sicilia-Valbuena-5-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 54,
    "Name": "caymus",
    "Description": "A dark, ruby red, with the lush scent of German chocolate cake and wisps of cigar tabacco. The palate of this wine is refined, bold, and layered, with cassis at the center, infused with warming notes of chocolate and ripe dark berries. Grippy tannis maintain structure yet are velvety soft, allowing flavors of continually evolve during a lingering finish that showcases this wine’s multiple layers of complexity.",
    "Price": 3600000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/45-Caymus-Napa-Valley-Cabernet-Sauvignon-2014-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 55,
    "Name": "catena zapata argentino",
    "Description": "A classically Argentine wine, our Alamos Malbec blends the deeply concentrated plum flavours of the country’s signature variety – Malbec – with small portions of Syrah and Bonarda to add dark cherry and blackberry flavours. Well-integrated hints of brown spice and vanilla contribute layers of complexity. A full structure, firm tannis and a long finish make this Malbec unforgettable.",
    "Price": 3300000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/16-BKK-Bodega-Vistalba-Corte-B-2015-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 56,
    "Name": "catena malbec",
    "Description": "The Catena wines are a special assemblage of High Mountain Estate Vineyards made by fourth generation vintner, Laura Catena and chief winemaker, Alejandro Vigil. Although we have found that most of the Catena wines are consumed shortly after release, we are pleased to see that they age beautifully for ten to twenty years. Through decades of study and exploration within Mendoza’s high altitude mountain terroirs, the Catena family has identified special locations for its Estate vineyards. From the marriage of these historic vineyards emerges a wine of unique character that has natural balance, concentration and a distinct varietal identity.",
    "Price": 1490000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Bodega-Vistalba-Corte-C-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 57,
    "Name": "catena cabernet sauvignon",
    "Description": "The Catena wines are a special assemblage of High Mountain Estate Vineyards made by fourth generation vintner, Laura Catena and chief winemaker, Alejandro Vigil. Although we have found that most of the Catena wines are consumed shortly after release, we are pleased to see that they age beautifully for ten to twenty years. Through decades of study and exploration within Mendoza’s high altitude mountain terroirs, the Catena family has identified special locations for its Estate vineyards. From the marriage of these historic vineyards emerges a wine of unique character that has natural balance, concentration and a distinct varietal identity.The Catena Cabernet Sauvignon shows a dark ruby color with violet tones. On the nose, it offers intense aromas of ripe raspberries and cassis with notes of pepper, clove, and a touch of cedar. On the palate, it is full-bodied and rich and displays layers of black currant and black raspberry with notes of cedar and oregano. This Cabernet Sauvignon is an elegant wine with silky tannins that provide structure and a long and persistent finish.Pair this Cabernet with red meats like steak or lamb, demi-glace sauces, or with Steak Frites for a simple bistro-style meal.",
    "Price": 1374000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Catena-Cabernet-Sauvignon-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 58,
    "Name": "catena alta malbec",
    "Description": "Catena Alta Malbec is deep violet in color with indigo highlights. The nose has aromas of ripe red and black berry fruits with notes of violets and lavender and hints of leather and a touch of spices. The wine is full-bodied and rich, with sweet tannins and a smooth structure, offering multiple layers of of blackberries and black currant with hints of liquorice, vanilla, and black pepper. This wine’s lengthy finish shows beautiful minerality with fine tannins and lively acidity.This Malbec would be absolutely wonderful with a variety of grilled meats but especially with more full-flavored dishes like Barbecued Leg of Lamb or Roasted Baby Goat.",
    "Price": 2700000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/23-Catena-Alta-Malbec-2012-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 59,
    "Name": "chateauneuf du pape, jaboulet",
    "Description": "This is the most famous appellation of the southern Rhône and also one of the best-known in France and abroad. Its rise to fame goes back to the presence of the papal seat in Avignon from 1309 to 1376. It was Pope John XXII who developed the château, which is today in ruins. Powerful and warm attack, with a spicy, hot finish.Pairs well with noisettes of venison with sauce grand veneur Fillet of beef with cèpes cream; Sautéd veal kidneys infused with lime.",
    "Price": 2700000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Parallele-45-Jaboulet-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 60,
    "Name": "castillo de molina",
    "Description": "Intense ruby-red color with violet hues. Characterized mainly by red fruits such as raspberry and cherry, as well as berries like blackberry and blueberry. There are also aromas provided by aging in barrels, lending the wine complexity. Balanced on the palate, with excellent volume and structure. Ripe tannins allow for a long, pleasing and elegant finish.",
    "Price": 714000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/30-Castillo-de-Molina-Cabernet-Sauvignon-2015-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 61,
    "Name": "cape mentelle",
    "Description": "At Cape Mentelle we draw inspiration from the great wines of the world. This is reflected in the techniques employed in our vineyards as we aim to produce wines that capture a unique sense of place in every bottle. These characteristics are defined by our pristine coastal location, unique soils and 40 years of viticultural history. Our philosophy extends beyond the glass as we endeavour to create a legacy of sustainability and longevity.  Constantly improving the potential of our vineyards and local environments, we pave the way for the next generation to continue the pursuit of crafting Australia’s definitive wine styles and while doing so we are preserving and building on what is uniquely Cape Mentelle.Nose: Perfumed violets and black currant, plum skin, Dutch cacao and rosemary. Palate: Medium to full bodied with sweet ripe fruits of mulberry, plums and currants. The structure is fine with grapey soft tannins providing great length and intensity of flavour balanced by a subtle mix of roasted spices.Pairs well with American style slow cooked and smoked beef ribs with coleslaw and pickled vegetables.",
    "Price": 1314000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/50-CAPE-MENTELLE-cabernet-merlot-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 62,
    "Name": "brunello di montalcino, gaja",
    "Description": "Colour: intense ruby red with garnet reflections. Bouquet: ethereal, wide, light vanilla. Taste: full, soft, velvety and intense, with sensations of liquorice, spices and light goudron note.This wine is particularly suited to accompany red meat, game and aged cheeses. Long aging potential.",
    "Price": 3300000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/35-Lapostolle-Cuvee-Alexandre-Merlot-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 63,
    "Name": "bourgogne pinot noir, domaine chanson",
    "Description": "Bright red colour with purple nuances. Intense aromas of raspberry and violets with a hint of pepper. Concentrated and well-structured. Refreshing, lively and displaying an array of spicy nuances.Super “everyday” Burgundy, ideal with braised and roasted meats, as well as meat-sauced pastas.",
    "Price": 1074000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/43-VN-DECOY-cabernet-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 64,
    "Name": "banfi aska, bolgheri",
    "Description": "The grapes of ASKA are vinified with a brief maceration in temperature-controlled stainless steel tanks for approximately 12-14 days. Once the alcoholic and malolactic fermentations are completed, the wine is aged for 10 months in oak barrels, completing its evolution with appropriate bottle aging.Color: Deep ruby red with violet reflections. Bouquet: Red berries, blueberries and plum jam are followed by hints of tobacco and licorice. Taste: The wine is well rounded, with velvety tannins and a persistent finish.Superb accompaniment to red meats, game, and aged cheeses.",
    "Price": 1554000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/67-Ornellaia-Le-Serre-Nuove-dellOrnellaia-2013-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 65,
    "Name": "atica antinori",
    "Description": "Intensely ruby red in color with purple highlights, the 2013 Tignanello shows an intense nose of ripe red fruit in addition to notes of vanilla, chocolate, and leather imparted from the oak. Spicy and balsamic sensations give additional complexity in the layers of aromatics. The wine is ample and enveloping on the palate with supple tannins and a savory freshness that fully respects the character and personality of the Sangiovese grape. The balance between acidity and tannins is excellent and the finish and aftertaste are of a lovely length and persistence.James Suckling – “This is amazing on the nose with blackberry, black truffle, dried cherry and hints of tobacco. So complex on the nose. Almost no need to taste it. Full body, soft and velvety tannins, and a persistent, fabulous finish. The mouthfeel is magic. 80% Sangiovese and 20% Cabernet Sauvignon. Drink or hold.”",
    "Price": 2394000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Chateau-dArmailhac-Rothschild-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 66,
    "Name": "amarone della valpolicella, tommasi",
    "Description": "Deep ruby red color with garnet shades. Warm, ripe on the nose, intense and of great refinement. The taste is complex, smooth, full bodied, lots of cherry notes and plum.TOMMASI Amarone is a wine which one can proudly serve on special occasions, particularly with red meats, game and ripe cheeses. But it can also be sipped an ideal companion to enjoyable conversation.",
    "Price": 2634000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/64-LUCENTE-LUCCE-DELLA-VITE-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 67,
    "Name": "alter ego de palmer",
    "Description": "Catena Alta Malbec is deep violet in color with indigo highlights. The nose has aromas of ripe red and black berry fruits with notes of violets and lavender and hints of leather and a touch of spices. The wine is full-bodied and rich, with sweet tannins and a smooth structure, offering multiple layers of of blackberries and black currant with hints of liquorice, vanilla, and black pepper. This wine’s lengthy finish shows beautiful minerality with fine tannins and lively acidity.This Malbec would be absolutely wonderful with a variety of grilled meats but especially with more full-flavored dishes like Barbecued Leg of Lamb or Roasted Baby Goat.",
    "Price": 4200000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Parallele-45-Jaboulet-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 68,
    "Name": "almaviva",
    "Description": "Attractive dark crimson, deep and opaque. The nose is pure and layered, revealing delicate and focused aromas of black cherries, ripe cassis and violet associated with black licorice, cacao and toffee notes.The mouth shows outstanding amplitude and balance, a luscious texture, bright acidity, elegance and persistence. The tannins are fine, smooth and silky, enhancing the fresh and juicy character of the year. Precise and well-built, the wine combines harmoniously elegance and freshness in a cooler and generous vintage.",
    "Price": 6000000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Almaviva-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 69,
    "Name": "alamos",
    "Description": "Deep and rich, our Alamos Cabernet Sauvignon expresses dark berry characteristics that are complemented nicely by slight herbal notes. Oak aging lent complex layers of brown spice and vanilla with firm tannis to this wine.",
    "Price": 894000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/1-Catena-Alamos-Cabernet-Sauvignon-2013-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 70,
    "Name": "casanova di neri, irrosso",
    "Description": "This is a big wine, as Syrah should be, but not so big that it floors you. Rich and oaky, it’s full of juicy black fruits, spice and a touch of liquorice (in sweet form, I can’t stand liquorice. But in wine, when done well, I can cope). Made by one of Chile’s biggest producers from grapes grown in the Maipo region, this shows their best side. If you’ve got sausages on the table, open this.Dark and deep red, bright. Very ripe and dense on the nose, remarkably focused on flavor, offering solid blackberry and cherry flavors. At the end a lasting smoky yet rich black-tar. Firm in texture, with fine grained tannins supporting bright fruit. There’s already some complexity beginning to develop out of its firm, quiet, supple core. drink now through 2015.",
    "Price": 1794000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Merryvale-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 71,
    "Name": "le serre nuove dellornellaia, bolgheri",
    "Description": "“A marvellous summer and a cool, sunny September made it possible to achieve perfect maturation of the grapes despite the difficult flowering period, with wines that express a particularly elegant side. Le Serre Nuove dell’Ornellaia 2013 has an intense, bright colour. The nose is vibrant and fruity underscored by delicate toasty notes. On the palate, the smooth, silky texture contrasts with tannins of great freshness. Whilst its structure will enable it to mellow with age, the crispness of the fruit and its soft, fine character make it perfect to enjoy straight away.”",
    "Price": 2274000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Parallele-45-Jaboulet-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 72,
    "Name": "cheval des andes",
    "Description": "Red ruby color with violet highlights. The nose is complex and elegant. It shows notes of tobacco and white pepper followed by some notes of ripe yellow fruits such as apricot, peach, black fig and quince jam. On the palate, the first impression is driven by mentholated hints. A very balanced character between acidity and the dense silkiness of the tannins impacts on the elegant finish of this Grand Cru. ",
    "Price": 3300000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/26-CHEVAL-DES-ANDES-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 73,
    "Name": "clos de la gaffeliere",
    "Description": "This wine delivers everything we are looking for from a great vintage. The color is an inky purple hue and the wine has aromas of coffee, blueberry, and toast. The palate is rich and complex, full of flavors of plum, boysenberry, and cocoa. The texture is lush, silky and full with well structured tannins that are approachable now or will cellar well for decades.",
    "Price": 1980000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Parallele-45-Jaboulet-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 74,
    "Name": "lapostolle, cuvee alexandre",
    "Description": "Ruby red with cherry edge. Red fruit aromas such as cherries and strawberry with fresh herbs aromas and a touch of vanilla. Silky and elegant attack, medium bodied with plums and cherry flavors.Drink now or cellar for several years. Decant for 1 hour and serve at 16°C (58° F). Enjoy with homemade pastas such as beetroot capeletti stuffed with cheese and pistachios or turkey panzotti and bolognesa sauce.The wine makers says: As a general winemaking philosophy, in our Cuvée Alexandre Merlot we look for elegance, balance and ageing potential. Express the terroir of Apalta is our mission; so, our winemaking philosophy remains a very natural process with minimal intervention. ",
    "Price": 1314000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/39-Montes-Alpha-M-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 75,
    "Name": "lapostolle merlot",
    "Description": "Valle del Rapel is located in the central part of Chile, including the sub Valleys of Cachapoal and Colchagua. It exhibits a semi–arid Mediterranean climate with a winter only rainfall pattern. During the growing season, we have warm and dry days and pleasantly cool nights as a result of cold breezes coming from the Andes Mountains. Rapel also has a cool influence from the Pacific’s Humboldt Current, which lowers temperatures in the coastal areas of the Valley. This leads to warm days with ample sunlight and dry conditions, allowing a slow ripening period and maintain its natural acidity that is a characteristic of our Lapostolle Grand Selection range. Color: Brilliant ruby color.Nose: Expressive nose of fresh red fruit such as plum, strawberries and cherries. Also chocolate, coffee and black pepper aromas.Palate: Fresh attack and a medium structure with soft and round tannins. Spicy mouthfeel with fresh red fruit flavors and a long and juicy finish.The ideal companion for pastas with red sauces, marinated pork and grilled red meat well seasoned.",
    "Price": 714000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/28-Lapostolle-Merlot-2014-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 76,
    "Name": "lapostolle cabernet",
    "Description": "The vision at Lapostolle is to create world class wines using French expertise and the outstanding terroirs in Chile.The Cabernet grapes are joined by small percentages of Syrah, Petit Verdot and Cabernet Franc each adding lifted aromatics to the already expressive aroma profile. Overall medium bodied with juicy cherry fruit surrounded by firm yet balanced tannins. Enjoy with tomato based pasta dishes and well seasoned, grilled red meats.",
    "Price": 890000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Lapostolle-Cabernet-Sauvignon-1-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 77,
    "Name": "kaiken ultra malbec",
    "Description": "The fruit for our Malbec Ultra was hand-picked into 15kg-trays in April. The process was aimed at preserving the berries, which were selected manually in the winery to ensure removal of any foreign particles capable of affecting final product quality.This deep brilliant red-colored wine with purplish tones displays rich aromas. The nose has interesting spicy and floral notes —a clear expression of a cool year—intertwined with black fruit aromas reminiscent of blueberries and blackberries that show this variety’s great typicity. Good structure and soft tannins call for a second glass. The finish is fresh, complex, and persistent with fruit notes and subtle spicy undertones of rosemary, thyme, and dry flowers.Pair with with stews, red meats or simply enjoy it with mature cheeses.",
    "Price": 1074000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Kaiken-Ultra-malbec-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 78,
    "Name": "kaiken reserva malbec",
    "Description": "Kaiken Reserva Malbec Reserva grapes come from vineyards in the Agrelo zone,60 km from the city of Mendoza and at an altitude of 950 meters above sea level. This terroir features soils composed of silt, clay, and sand with a presence of stones at a depth of two meters and derived from erosion from the Andes Mountains. The region’s climate is warmer than that of the Uco Valley, which allows us to obtain grapes with more fresh fruit aromas and flavors as well as very soft tannins.Kaiken Reserva Malbec is deep purple in colour. Dried fruit aromas of strawberries and cherries are nicely complemented with spicy notes and menthol aromas. On the palate this wine displays extraordinary balance, freshness and soft tannins.",
    "Price": 774000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Kaiken-Reserva-malbec-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 79,
    "Name": "guidalberto by sassicaia",
    "Description": "Tenuta San Guido release their second wine Guidalberto a year before Sassicaia. The name Guidalberto, introduced in 2000.0, was inspired by the current proprietor’s great great great grandfather Guidalberto della Gheradesca. The wine was created for two reasons; the Estates desire to accomplish something with Merlot (a grape that they do not use in Sassicaia) and to create a wine which could be enjoyed younger than their ‘veteran Sassicaia’.",
    "Price": 2694000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Guidalberto-by-Sassicaia-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 80,
    "Name": "guado al tasso",
    "Description": "Intense floral notes of acacia and linden flowers. The refreshing presence of Fiano gives notes of fern, musk and menthol. On the palate, it is fresh and compact with notes of bergamot, pear, nectarine and white currant. Then it shifts toward a more mineral and spicy character, with notes of flint, rosemary, saffron. The wine gets riper in the finish with hints of mango, almond and fig leaves.On the palate, the wine is intensely smooth and characterized by an electric tang of acidity and minerality. The wine finishes with ripe and honey notes.",
    "Price": 4740000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Muga-reserva-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 81,
    "Name": "gevrey chambertin, latour",
    "Description": "Situated about 10 Km from Dijon, Gevrey-Chambertin is one of the finest viticultural villages of the Côte de Nuits. In 1847 Gevrey-Chambertin was the first village of the Côte d’Or to join the village name with that of one of its Grand Crus – hence ‘Gevrey-en-Montagne’ became ‘Gevrey-Chambertin. Planted only with Pinot Noir, here one finds the complete hierarchy of the Burgundian appellations: to the north, the premiers crus and to the south the grand crus. The village appellations are gathered on the bottom of the slope. The sparse and pebbly limestone-rich brown-red soils give Gevrey-Chambertin wines power and body. A great Côte de Nuits classic!",
    "Price": 2940000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Kaiken-Reserva-malbec-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 82,
    "Name": "gaja sito moresco",
    "Description": "Intense floral notes of acacia and linden flowers. The refreshing presence of Fiano gives notes of fern, musk and menthol. On the palate, it is fresh and compact with notes of bergamot, pear, nectarine and white currant. Then it shifts toward a more mineral and spicy character, with notes of flint, rosemary, saffron. The wine gets riper in the finish with hints of mango, almond and fig leaves.On the palate, the wine is intensely smooth and characterized by an electric tang of acidity and minerality. The wine finishes with ripe and honey notes.",
    "Price": 2394000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Dominus-estate-cabernet-sauvignon-napa-valley-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 83,
    "Name": "chianti classico peppoli antinori",
    "Description": "Pèppoli was first marketed in 1988 with the initial vintage, the 1985, and represents a wine which is both complex and well structured but with much fruit and aromatic fragrance as well. It is produced at the estate of the same name, and since the year 2013 a part of the crop is fermented at the Antinori Chianti Classico cellars at Bargino.Ruby red in color with purple highlights, the wine shows intensely fruity notes of cherries and red currants on the nose which fuse very well with the typical sensations of violets which characterize Chianti Classico. Very delicate and quite well integrated the smoky sensations created by the oak aging. The palate is savory with a tasty vein of acidity together with silky and polished tannins.Pairs well with homemade pizza, cured meats or pasta with Bolognese sauce.",
    "Price": 2034000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/4-CHIANTI-CLASSICO-PEPPOLI-ANTINORI-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 84,
    "Name": "gaja camarcanda, promis",
    "Description": "Intense floral notes of acacia and linden flowers. The refreshing presence of Fiano gives notes of fern, musk and menthol. On the palate, it is fresh and compact with notes of bergamot, pear, nectarine and white currant. Then it shifts toward a more mineral and spicy character, with notes of flint, rosemary, saffron. The wine gets riper in the finish with hints of mango, almond and fig leaves.On the palate, the wine is intensely smooth and characterized by an electric tang of acidity and minerality. The wine finishes with ripe and honey notes.",
    "Price": 1974000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/46-Opus-One-2013-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 85,
    "Name": "errazuriz estate",
    "Description": "Intense cherry red in colour. The nose displays aromas that evoke pencil lead, fresh-roasted coffee beans, light notes of caramel, cloves, and black pepper, while aromas of figs, dates, and cherries lend even greater appeal. The palate echoes the nose with notes of red bell pepper, figs, dates, and cherries, along with a touch of coffee, chocolate, cloves, and black olives. Smooth and round on the medium-bodied palate with elegant and very friendly tannins.",
    "Price": 890000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/4-CHIANTI-CLASSICO-PEPPOLI-ANTINORI-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 86,
    "Name": "donnafugata mille e una notte",
    "Description": "Intense floral notes of acacia and linden flowers. The refreshing presence of Fiano gives notes of fern, musk and menthol. On the palate, it is fresh and compact with notes of bergamot, pear, nectarine and white currant. Then it shifts toward a more mineral and spicy character, with notes of flint, rosemary, saffron. The wine gets riper in the finish with hints of mango, almond and fig leaves.On the palate, the wine is intensely smooth and characterized by an electric tang of acidity and minerality. The wine finishes with ripe and honey notes.",
    "Price": 3480000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/71-Ornellaia-Bolgheri-DOC-Superiore-2013-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 87,
    "Name": "don melchor",
    "Description": "Deep cherry red in color, Don Melchor captivates with its balanced, depth, and complexity. The aromas of red fruits delicately intermingle with mineral notes that recall cold ashes and pencil lead. Fine, delicate textures appear on the palate and show this to be an ample, deep wine with a smooth, fine attack followed by an intense, mouth-filling evolution. Concentrated, expressive, and generous in flavors and aromas with a long finish dominated by the balance and elegance of the various layers of flavors.Pair with red meats (beef and lamb) and game in different preparations, such as roasts, stews, or braises with red wine, mushrooms, rosemary, and tomatoes. Also pairs very well with assorted terrines and patés, especially duck with truffles, or with aged, dried, or creamy cow’s or goat’s milk cheeses.",
    "Price": 4740000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Don-Melchor-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 88,
    "Name": "dominus (100 pts js)",
    "Description": "Dominus, with its remarkably complex nose, is an utterly seductive wine. It displays red and black fruits and an ethereal aroma of deep cherry, warm citrus and marzipan. Finely polished tannins on a beautiful, weightless finish are accompanied by great depth and length.",
    "Price": 13200000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Parallele-45-Jaboulet-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 89,
    "Name": "dog point",
    "Description": "Lucente 2014 is a deep red color with purple highlights. The wine’sbouquet is complex: fruity notes of black cherry and small red fruitsare enhanced by moderately toasted scents; pleasant vanilla and lightly roasted coffee beans linger delicately in the background. Well rounded with silky tannins that bestow a balanced and harmonious structure, this is an eminently elegant and enjoyable wine.James Suckling – “Lots of blueberry, black currant and lavender aromas and flavors to this. Medium to full body, fine tannins and a fresh finish. Drink or hold. So long and refined. Extremely well done.”",
    "Price": 2094000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Parallele-45-Jaboulet-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 90,
    "Name": "decoy by duckhorn",
    "Description": "From its deep ruby and violet hue to its enticing fruit-forward aromas of blackberry, currant and black cherry, this wine showcases a great Sonoma County Cabernet Sauvignon. On the palate, the lush fruit is balanced by smooth, rich tannins and lovely layers of spice, cocoa and hints of sweet and toasty French oak.Wine Enthusiast – “Made for broad release, this wine impresses for its rounded, approachable layers of dried herb and anise, the tannin and oak lightly applied. Blended with 10% Merlot, it finds a jolt of richness on the finish, a showcase for notions of chocolate, cherry and blackberry.”",
    "Price": 1314000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Penfolds-Bin-407-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 91,
    "Name": "cornas, maison les alexandrins",
    "Description": "Cornas has a dark full color with a purple edge. The aroma is intense with black fruit, pepper, violets and roasted chocolate. Cornas tastes powerful and dark with spicy fruit that clearly refers to the granite surface. The wine has ripe and round tannins and a stunning mineral final.Serve at room temperature, when young with grilled meat, delicious after 5 years with game and aged cheeses.This small appellation is located on the right bank of the Rhone Valley with granite soils at an altitude of 300m. A cold maceration removes all the aromas and the deep color from the fruit. In all, maceration and fermentation takes 20 days with pumping and pigeage to the end. The wine ages in 1 and 2 year old barrels for 15 months.",
    "Price": 1554000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Parallele-45-Jaboulet-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 92,
    "Name": "clos du val",
    "Description": "This wine delivers everything we are looking for from a great vintage. The color is an inky purple hue and the wine has aromas of coffee, blueberry, and toast. The palate is rich and complex, full of flavors of plum, boysenberry, and cocoa. The texture is lush, silky and full with well structured tannins that are approachable now or will cellar well for decades.",
    "Price": 1914000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Clos-du-Val-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 93,
    "Name": "clos apalta",
    "Description": "Cool aromas of cola, coffee, blackberry, stewed plum, herbs and minerals make for a highly attractive and complex bouquet. In the mouth, wall-to-wall power and tannins suggest that this needs a few more years to mellow out. Flavors of stewed plum, blackberry, Carolina barbecue sauce and a hint of citrus peel are complex and set up a deep finish with dark flavors and intensity to spare.",
    "Price": 4800000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/40-Lapostolle-Clos-Apalta-2011-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 94,
    "Name": "gaja barbaresco",
    "Description": "Intense floral notes of acacia and linden flowers. The refreshing presence of Fiano gives notes of fern, musk and menthol. On the palate, it is fresh and compact with notes of bergamot, pear, nectarine and white currant. Then it shifts toward a more mineral and spicy character, with notes of flint, rosemary, saffron. The wine gets riper in the finish with hints of mango, almond and fig leaves.On the palate, the wine is intensely smooth and characterized by an electric tang of acidity and minerality. The wine finishes with ripe and honey notes.",
    "Price": 7500000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/73-MARCHESI-ANTINORI-“SOLAIA”-100x100.jpg",
    "SubCategory": 20,
    "Category": 5
  },
  {
    "Id": 95,
    "Name": "veuve clicquot brut",
    "Description": "A Champagne House is eventually judged on the quality of its Brut Non Vintage. It is in the making of such a wine that the true Art of Champagne blending reveals itself. This is an art in which the House of Veuve Clicquot excels. Our Brut Yellow Label reflects the superb vineyards we own and the consistent nature of our House style.The predominance of Pinot Noir provides the structure that is so typically Clicquot, while a touch of Pinot Meunier rounds out the blend. Chardonnay adds the elegance and finesse essential in a perfectly balanced wine.",
    "Price": 2340000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Clos-du-Val-100x100.jpg",
    "SubCategory": 16,
    "Category": 5
  },
  {
    "Id": 96,
    "Name": "GREEN ASPARAGUS SOUP",
    "Description": "",
    "Price": 290000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/40-Lapostolle-Clos-Apalta-2011-100x100.jpg",
    "SubCategory": 0,
    "Category": 0
  },
  {
    "Id": 97,
    "Name": "ARGENTINIAN BEEF FILET SOUP",
    "Description": "",
    "Price": 290000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/40-Lapostolle-Clos-Apalta-2011-100x100.jpg",
    "SubCategory": 0,
    "Category": 0
  },
  {
    "Id": 98,
    "Name": "LOBSTER AND CRAB MEAT SOUP",
    "Description": "",
    "Price": 290000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/40-Lapostolle-Clos-Apalta-2011-100x100.jpg",
    "SubCategory": 0,
    "Category": 0
  },
  {
    "Id": 99,
    "Name": "BEEF EMPANADA",
    "Description": "",
    "Price": 180000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/40-Lapostolle-Clos-Apalta-2011-100x100.jpg",
    "SubCategory": 2,
    "Category": 0
  },
  {
    "Id": 100,
    "Name": "CHORIZO BEEF",
    "Description": "Homemade argentinian spiced sausage",
    "Price": 210000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/40-Lapostolle-Clos-Apalta-2011-100x100.jpg",
    "SubCategory": 2,
    "Category": 0
  },
  {
    "Id": 101,
    "Name": "SALCHICHA",
    "Description": "Homemade argentinian spicy sausage",
    "Price": 210000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/40-Lapostolle-Clos-Apalta-2011-100x100.jpg",
    "SubCategory": 2,
    "Category": 0
  },
  {
    "Id": 102,
    "Name": "PROVOLETA",
    "Description": "Grilled provolone cheese, tomato with a hint of oregano",
    "Price": 280000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/40-Lapostolle-Clos-Apalta-2011-100x100.jpg",
    "SubCategory": 2,
    "Category": 0
  },
  {
    "Id": 103,
    "Name": "TACOS",
    "Description": "Lean homemade minced beef, crispy taco shells, avocado, tomato, chives, coriander (2PCS PER SERVING)",
    "Price": 290000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/40-Lapostolle-Clos-Apalta-2011-100x100.jpg",
    "SubCategory": 2,
    "Category": 0
  },
  {
    "Id": 104,
    "Name": "BRANDED 4 SHORT GLASSES",
    "Description": "Our branded shot glasses are the real, thick, heavy restaurant shot glasses, that shouldn’t miss in your home and for anybody who stocks up on our famous El Caramel Vodka, they are simply a must.",
    "Price": 400000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/short-glass-100x100.jpg",
    "SubCategory": 22,
    "Category": 7
  },
  {
    "Id": 105,
    "Name": "BRANDED ASHTRAY (GOLDEN)",
    "Description": "Whatever you will do, this brass ashtray will simply never break. It is very heavy and by it’s weight and look, the perfectly stylish and functional in- and outdoor item.",
    "Price": 1500000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Ashtray-100x100.jpg",
    "SubCategory": 22,
    "Category": 7
  },
  {
    "Id": 106,
    "Name": "BRANDED HAND TOWEL",
    "Description": "Our hand towels are the perfect companions for all occassion in warm cities as these, where a good sweat towel gives you a lot of comfort. 100% white cotton with the an embroidered El Gaucho logo.",
    "Price": 100000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Hand-towel-100x100.jpg",
    "SubCategory": 22,
    "Category": 7
  },
  {
    "Id": 107,
    "Name": "BRANDED SHIRT PIN",
    "Description": "Our El Gaucho pins are the real Steak Lover collector items for any shirt, jacket, bag or simply to have.",
    "Price": 100000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Shirt-Pin-100x100.jpg",
    "SubCategory": 22,
    "Category": 7
  },
  {
    "Id": 108,
    "Name": "BRANDED STEAK KNIFE",
    "Description": "We love our branded steak knifes and we can tell you, by using them on a daily base in all our restaurants, it is a highly reliable knife that goes well with any cutlery and dinnerware.",
    "Price": 250000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/Knife-100x100.jpg",
    "SubCategory": 22,
    "Category": 7
  },
  {
    "Id": 109,
    "Name": "EL CARAMEL",
    "Description": "Our homemade Vodka Caramel is our signature shot served to all our customers after a delicious meal. Carefully blending Belvedere Vodka with Monin Caramel in a special ratio, our very own El Caramel is loved by women and men likewise. Served ice-cold, it is simply pure pleasure and so delightful!",
    "Price": 910000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/EL-CARAMEL-VN-100x100.jpg",
    "SubCategory": 22,
    "Category": 7
  },
  {
    "Id": 110,
    "Name": "CHORIZO BEEF",
    "Description": "Our homemade Chorizo is a traditional Argentinian spiced sausage. In our version and in the tradition of our restaurants, we combine high quality ground (minced) beef, blend of our four cuts of beef, combined with several spices. It is the combination of the Filet USDA Prime, Filet Premium Black Angus, Filet Certified Black Angus, Rib Eye USDA Prime and Rib Eye Certified Black Angus with salt, pepper, sweet paprika, garlic, bay leaves, oregano, cayenne pepper and a little soda water, all encased in a 100% plant based casing, which is also suitable for our Halal applications.",
    "Price": 245000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/El-Gaucho-Argentinian-Steakhouse-Restaurant-Chorizo-Beef-100x100.jpg",
    "SubCategory": 21,
    "Category": 6
  },
  {
    "Id": 111,
    "Name": "HAMBURGER PATTY",
    "Description": "Our 220g homemade burger patties, blend of our four cuts, are a freshly ground selection of El Gaucho US beef prime cuts. Grounding the Filet USDA Prime, Filet Premium Black Angus, Filet Certified Black Angus, Rib Eye USDA Prime, Rib Eye Certified Black Angus, enriching it with onions and seasoning it with only salt and pepper, allows all burgers this juicy, pure, but flavourful taste",
    "Price": 180000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/El-Gaucho-Argentinian-Steakhouse-Restaurant-Hamburger-Patty-100x100.jpg",
    "SubCategory": 21,
    "Category": 6
  },
  {
    "Id": 112,
    "Name": "LAMB CHOPS (CAP OFF)",
    "Description": "Our Mulwarra lamb is premium quality Fresh Australian Range Fed Lamb and Milk Fed Lamb sourced from the prime lamb production areas of South Eastern Australia. Our lamb is processed by two of Australia’s leading lamb processors with a large number of lambs sourced directly from leading grower’s groups. These growers produce lamb recognised as the finest available and they ensure we have a reliable year-round supply of quality lambs. Hand-cut and hand-trimmed by the El Gaucho butchers it is a remarkable Halal certified and mouth-watering lamb chop. The Chateau Musar Red 2004 pairs very well with lamb and veal with fresh herbs. It has a palate full of rich black and red fruits – plums and damsons dominate with pomegranate, baked cherries and Christmas spices. An intensely concentrated powerful vintage withfine smooth tannins and a spicy, warmingfinish.",
    "Price": 327000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/El-Gaucho-Argentinian-Steakhouse-Restaurant-Lamb-Chop-100x100.jpg",
    "SubCategory": 21,
    "Category": 6
  },
  {
    "Id": 113,
    "Name": "NEW YORK STRIPLOIN PLATINUM",
    "Description": "The New York Striploin is known as a classic steakhouse cut, juicy and flavourful with the perfect ‘bite’. Taken from in-between the 13th and 14th rib, the loin section, the Striploin is not as tender as the tenderloin, but much more flavourful and often called from gourmands the tastiest cut. All US products in our restaurants are Halal certified and supplied by the company Greater Omaha Packing – The company is family owned and operated since 1920. Located in the heart of the Corn Belt, the beef supplied by the company always exceeds high expectations. The Bodega Vistalba Corte C from Mendoza has an intense red colour. Red fruits aromas, prunes and rippen cherries. Sweet entrance, silky tannis. Rippened cherries and dry fruits such as almonds and nuts. Beside meat, the Vistalba Corte C goes very well with pasta, legumes and mature cheese.",
    "Price": 676000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/El-Gaucho-Argentinian-Steakhouse-Restaurant-Striploin-Platinum-100x100.jpg",
    "SubCategory": 21,
    "Category": 6
  },
  {
    "Id": 114,
    "Name": "SALCHICHA BEEF",
    "Description": "Our homemade Salchicha is a traditional Argentinian spicy sausage. In our version and in the tradition of our restaurants, we combine high quality ground (minced) beef in combination with several spices. It is the combination of the Filet USDA Prime, Filet Premium Black Angus, Filet Certified Black Angus, Rib Eye USDA Prime and Rib Eye Certified Black Angus with salt, pepper, sweet paprika, garlic, fresh chillies, bay leaves, oregano, cayenne pepper and a little soda water, all encased in a 100% plant based casing, which is also suitable for our Halal applications.",
    "Price": 245000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/El-Gaucho-Argentinian-Steakhouse-Restaurant-Salchicha-100x100.jpg",
    "SubCategory": 21,
    "Category": 6
  },
  {
    "Id": 115,
    "Name": "T-BONE USDA PRIME",
    "Description": "A favorite among many cooks that includes both of the most prized cuts on a cow. The T-bone steak is cut from the saddle and easy to recognize because of its two meats ¬– sirloin on one side and tenderloin on the other – separated by a T-shaped bone. A T-bone steak becomes a porterhouse steak when it comes from the back of the short loin, where the tenderloin section is larger.",
    "Price": 7900000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/El-Gaucho-Argentinian-Steakhouse-T-Bone-100x100.jpg",
    "SubCategory": 21,
    "Category": 6
  },
  {
    "Id": 116,
    "Name": "WAGYU TOMAHAWK (MS 4/5) (BONE IN)",
    "Description": "Named because it allegedly resembles the Tomahawk axe, the Tomahawk steak is an on-the bone rib steak, cut from the fore-rib with the entire rib bone left. As it is a bone-in rib steak, it has a large amount of inter-mus- cular fat, which gives it this intense flavour when cooked, as flavours are released from both, the huge bone, and inter-muscular fat during roasting to give a sweet gelatinous flavour. Supplied by Australia’s number one producer of premium quality Wagyu Beef, the quality of the Wagyu is fully audited by the Japanese Organisation of MAFF and fully subject to the Japanese Agriculture Standards (JAS}, ensuring that the entire breeding program is producing beef with the highest standards for meat quality and safety.",
    "Price": 1937000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/el-gaucho-argentinian-steakhouse-restaurant-wagyu-tomahawk-100x100.jpg",
    "SubCategory": 21,
    "Category": 6
  },
  {
    "Id": 117,
    "Name": "FILET STEAK (USDA PRIME)",
    "Description": "The USDA Prime is the highest grade of beef in the USA and properly aged in our cold storage for additional 21 to 28 days to fully develop the flavour and tenderness for that melt in your mouth and consistent quality experience. Taken from the smaller end of the tenderloin and located between the sirloin and rib, hand-cut and hand-trimmed by the El Gaucho butchers, the filet steak is a feast for the eye and the mouth. The Castello D’Albola Chianti Classico DOCG 2011 from Tuscany pairs nicely with a filet. It is firm and taut, with a core of cherry and berry flavors, accented by underbrush tobacco and iron notes, balanced with a mineral aftertaste. Perfect for dishes of the traditional Chianti cuisine, as well as for grilled meats and mature cheeses.",
    "Price": 497500,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/El-Gaucho-Argentinian-Steakhouse-Restaurant-Filet-USDA-Prime-100x100.jpg",
    "SubCategory": 21,
    "Category": 6
  },
  {
    "Id": 118,
    "Name": "FILET STEAK PLATINUM",
    "Description": "The USDA Prime is the highest grade of beef in the USA and properly aged in our cold storage for additional 21 to 28 days to fully develop the flavour and tenderness for that melt in your mouth and consistent quality experience. Taken from the smaller end of the tenderloin and located between the sirloin and rib, hand-cut and hand-trimmed by the El Gaucho butchers, the filet steak is a feast for the eye and the mouth. The Castello D’Albola Chianti Classico DOCG 2011 from Tuscany pairs nicely with a filet. It is firm and taut, with a core of cherry and berry flavors, accented by underbrush tobacco and iron notes, balanced with a mineral aftertaste. Perfect for dishes of the traditional Chianti cuisine, as well as for grilled meats and mature cheeses.",
    "Price": 622500,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/El-Gaucho-Argentinian-Steakhouse-Restaurant-Filet-Platinum-100x100.jpg",
    "SubCategory": 21,
    "Category": 6
  },
  {
    "Id": 119,
    "Name": "FILET STEAK - PREMIUM BLACK ANGUS BEEF",
    "Description": "Grown in Australia’s south eastern Gippsland region, all cattle enjoy nutrient-rich pastures and high quality grass feed year around, no exposure to Hormone Growth Promotants, as well as a stress-free environment which guarantees the most tender beef. Taken from the smaller end of the tenderloin and located between the sirloin and rib, the filet steak remains a top selling steak. Being slightly marbled, the grass-fed beef is characteristically flavoursome and allowing a unique presentation. The Giesen Pinot Noir Marlborogh 2014 from New Zealand pairs very nicely with the filet. It is an expressive wine with aromas of red cherry, plum, dry spice and earthy mushroom notes. The vibrant fruit driven palate shows concentrated red fruit with savour flavours and well rounded yet firm tannis with great length. Perfect for beef, mushroom sauce and cheese as brie, camembert, Gruyeres and goat cheese.",
    "Price": 322500,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/El-Gaucho-Argentinian-Steakhouse-Restaurant-Filet-Black-Angus-100x100.jpg",
    "SubCategory": 21,
    "Category": 6
  },
  {
    "Id": 120,
    "Name": "FILET STEAK",
    "Description": "",
    "Price": 1937000.0,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/el-gaucho-argentinian-steakhouse-restaurant-wagyu-tomahawk-100x100.jpg",
    "SubCategory": 8,
    "Category": 2
  },
  {
    "Id": 121,
    "Name": "NEW YORK STRIPLOIN",
    "Description": "The USDA Prime is the highest grade of beef in the USA and properly aged in our cold storage for additional 21 to 28 days to fully develop the flavour and tenderness for that melt in your mouth and consistent quality experience. Taken from the smaller end of the tenderloin and located between the sirloin and rib, hand-cut and hand-trimmed by the El Gaucho butchers, the filet steak is a feast for the eye and the mouth. The Castello D’Albola Chianti Classico DOCG 2011 from Tuscany pairs nicely with a filet. It is firm and taut, with a core of cherry and berry flavors, accented by underbrush tobacco and iron notes, balanced with a mineral aftertaste. Perfect for dishes of the traditional Chianti cuisine, as well as for grilled meats and mature cheeses.",
    "Price": 497500,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/El-Gaucho-Argentinian-Steakhouse-Restaurant-Filet-USDA-Prime-100x100.jpg",
    "SubCategory": 8,
    "Category": 2
  },
  {
    "Id": 122,
    "Name": "Add On - Foie Gras",
    "Description": "The USDA Prime is the highest grade of beef in the USA and properly aged in our cold storage for additional 21 to 28 days to fully develop the flavour and tenderness for that melt in your mouth and consistent quality experience. Taken from the smaller end of the tenderloin and located between the sirloin and rib, hand-cut and hand-trimmed by the El Gaucho butchers, the filet steak is a feast for the eye and the mouth. The Castello D’Albola Chianti Classico DOCG 2011 from Tuscany pairs nicely with a filet. It is firm and taut, with a core of cherry and berry flavors, accented by underbrush tobacco and iron notes, balanced with a mineral aftertaste. Perfect for dishes of the traditional Chianti cuisine, as well as for grilled meats and mature cheeses.",
    "Price": 622500,
    "ImageUrl": "https://vn.elgaucho.asia/wp-content/uploads/2020/04/El-Gaucho-Argentinian-Steakhouse-Restaurant-Filet-Platinum-100x100.jpg",
    "SubCategory": 8,
    "Category": 2
  }
]
