[
  {
    "Name": "BANFI LE RIME",
    "Description": "Pinot Grigio and Chardonnay are nurtured to perfection in select hillside vineyards of the Banfi estate in Montalcino, Tuscany. The grapes are gently pressed, followed by vinification “in bianco,” or “off the skins” at low temperatures in stainless steel resulting in a delightfully harmonious wine. Le Rime, pale straw in color, is an aromatic, fruity white wine with a crisp finish replete with refreshing acidity. Served chilled, Le Rime is the perfect partner to a full range of foods including pasta, vegetables, fish, seafood, veal and poultry dishes.Pale straw yellow. Bouquet: Hints of pear and white flowers. Taste: Well balanced with an unusually lively acidity.A splendid aperitif and a delightful complement to antipasto, pasta, and light meals.",
    "Price": 654000
  },
  {
    "Name": "CHABLIS, DOMAINE CHANSON",
    "Description": "Aromas of grape fruit mixed with floral fragrances on a delicate minerality. Pure, pinear and well-defined, good structure, beaufitul aromatic combination, refreshing mineral finish, straight and of good length.Fish pâté, veal with cream sauce, lobsters and poultry as well as some goat cheeses.",
    "Price": 1254000
  },
  {
    "Name": "CLOUDY BAY",
    "Description": "Bright, focused citrus aromatics of grapefruit and kaffir lime abound, supported by subtle tropical notes. A silky, concentrated palate reveals ripe, juicy stone fruit and lemongrass, supported by a subtle minerality. Its racy acidity leads toward a mouth-watering, persistent finish, suggesting a sauvignon blanc with ageability.This wine will complement fish, poultry, white meats and cured meats.",
    "Price": 1494000
  },
  {
    "Name": "GAJA CA'MARCANDA, VISTAMARE",
    "Description": "Intense floral notes of acacia and linden flowers. The refreshing presence of Fiano gives notes of fern, musk and menthol. On the palate, it is fresh and compact with notes of bergamot, pear, nectarine and white currant. Then it shifts toward a more mineral and spicy character, with notes of flint, rosemary, saffron. The wine gets riper in the finish with hints of mango, almond and fig leaves.On the palate, the wine is intensely smooth and characterized by an electric tang of acidity and minerality. The wine finishes with ripe and honey notes.",
    "Price": 2100000
  },
  {
    "Name": "MEURSAULT 1ER CRU PERRIERES, LATOUR",
    "Description": "Situated just south of Volnay and Pommard in the Côte de Beaune, Meursault is the most extensive southerly white wine commune of the Côte-d’Or. Surprisingly enough for an appellation of this quality, no Grand Cru exists, however the high quality of the 1er Cru more then compensates for this. The vineyard of Meursault « Perrières » tends to show a soil that is thinner and stonier than many of its immediate neighbours, producing what is arguably one of the finest example of the wine from this village.This 1er Cru offers a complex and floral nose with grilled almond hints. The mouth is round with acacia honey and yellow peach notes. The oaky is ample lingering into a beautiful persistence.Chicken in cream sauce – skate in brown butter – white truffle risotto – Epoisses cheese",
    "Price": 3000000
  },
  {
    "Name": "SCHLOSS VOLLRADS",
    "Description": "This is a beautifully aromatic wine. The nose and palate are filled with peaches, lemon, and lime rind, along with stony minerality and a nice touch of petrol. Just a bit off-dry, but with juicy acidity the Schloss Vollrads is ripe and full. There is a hint of bitterness in the long finish. A perfect wine for a warm summer evening!",
    "Price": 894000
  },
  {
    "Name": "TRIVENTO GOLDEN RESERVE",
    "Description": "Founded in 1996, Trivento produces brand-name wines under their own label. The company has created a portfolio of wines distinguished for preserving the character of the Mendozan terroir. These wines have received numerous recognitions at international contests and in wine industry publications. Trivento has become the most diversely distributed Argentine wine brand in the world positioning the positioning the company among the preeminent Argentine exporters.Yellow with olive tinges in colour with aromas of white peach and green apple. Fresh acidity with a fruity finish.Wine of Mendoza, Argentina; 2016 Gold Decanter Award winner",
    "Price": 1494000
  },
  {
    "Name": "TRIVENTO RESERVE",
    "Description": "Founded in 1996, Trivento produces brand-name wines under their own label. The company has created a portfolio of wines distinguished for preserving the character of the Mendozan terroir. These wines have received numerous recognitions at international contests and in wine industry publications. Trivento has become the most diversely distributed Argentine wine brand in the world positioning the positioning the company among the preeminent Argentine exporters.Yellow with olive tinges in colour with aromas of white peach and green apple. Fresh acidity with a fruity finish.Wine of Mendoza, Argentina; 2016 Gold Decanter Award winner",
    "Price": 534000
  },
  {
    "Name": "VILLA MARIA PRIVATE BIN",
    "Description": "Fruit for this wine was sourced from vineyards across the Marlborough region in the Wairau and Awatere valleys spanning a range of different meso-climates. Careful attention was paid to vine health and cropping levels to give the vine the best chance to optimise the season and develop strong, clean flavours.This intense Sauvignon Blanc is alive with a myriad of flavours dominated by gooseberry, passionfruit, fresh citrus, melon and herbaceous aromas. The wine has an enticing palate with a juicy flavour profile, purity and concentration, finishing crisp and clean with an interwoven thread of acidity.This Sauvignon Blanc is the perfect pairing with seafood and all white meats.",
    "Price": 990000
  }
]
